In [1]:
import numpy as np

In [2]:
import pandas as pd

### 1. pd.Series()

In [3]:
labels = ['a','b','c']
my_data = [10, 20, 30]

- you can pas <b>list[]</b> as data into Series

In [5]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [ ]:
pd.Series(my_data, labels)

- you can pass numpy array <b>np.array()</b> as data into Series

In [8]:
arr = np.array(my_data)
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

- you can pass <b>dictionary {}</b> as data into Series (automatically gets the labels)

In [9]:
dictionary = {'a':10, 'b':20, 'c':30}
pd.Series(dictionary)

a    10
b    20
c    30
dtype: int64

- it can holds functions itselves in <b>Python 3!!!!</b>

In [11]:
pd.Series(data=[sum,print])

SyntaxError: invalid syntax (<ipython-input-11-385ead1baee9>, line 1)

In [28]:
ser1=pd.Series([5,4,3],['Excellent','Good','Ok'])
ser1

Excellent    5
Good         4
Ok           3
dtype: int64

In [27]:
ser2 = pd.Series([5,4,2],['Excellent','Good', 'Bad'])
ser2

Excellent    5
Good         4
Bad          2
dtype: int64

In [19]:
ser1['Good']

4

In [20]:
ser2['Bad']

2

- if labels are set, then we need to pass the key ('Bad'), passing the index is not working anymore

In [29]:
ser1+ser2

Bad           NaN
Excellent    10.0
Good          8.0
Ok            NaN
dtype: float64

### 2. DataFrames basics

In [5]:
from numpy.random import randn

In [41]:
np.random.seed(100)
df =pd.DataFrame(randn(5,4), ['a','b','c','d','e'], ['w','x','y','z'])

In [42]:
df

          w         x         y         z
a -1.749765  0.342680  1.153036 -0.252436
b  0.981321  0.514219  0.221180 -1.070043
c -0.189496  0.255001 -0.458027  0.435163
d -0.583595  0.816847  0.672721 -0.104411
e -0.531280  1.029733 -0.438136 -1.118318

### 3. Get columns of dataFrame

- Each column is <b>pd.Series</b>!

In [43]:
type(df['w'])

pandas.core.series.Series

In [44]:
type(df)

pandas.core.frame.DataFrame

- Grab a column! (Different ways)

In [45]:
df['w']

a   -1.749765
b    0.981321
c   -0.189496
d   -0.583595
e   -0.531280
Name: w, dtype: float64

In [46]:
df.w

a   -1.749765
b    0.981321
c   -0.189496
d   -0.583595
e   -0.531280
Name: w, dtype: float64

- df.w can override internal methods names, like df.items, so don't use it!

### 4. Get multiply columns

<b>dataFrame [list]</b>

In [48]:
df[['w','z']]

          w         z
a -1.749765 -0.252436
b  0.981321 -1.070043
c -0.189496  0.435163
d -0.583595 -0.104411
e -0.531280 -1.118318

In [74]:
lst = ['w','x','y']
df[lst[1:]]

     x         y
a  1.0  1.153036
b  1.0  0.221180
c  1.0 -0.458027
d  1.0  0.672721
e  1.0 -0.438136

### 5. Adding a new column based on existing ones

In [49]:
df['new']=df['y']+df['z']
df

          w         x         y         z       new
a -1.749765  0.342680  1.153036 -0.252436  0.900600
b  0.981321  0.514219  0.221180 -1.070043 -0.848864
c -0.189496  0.255001 -0.458027  0.435163 -0.022863
d -0.583595  0.816847  0.672721 -0.104411  0.568310
e -0.531280  1.029733 -0.438136 -1.118318 -1.556454

In [50]:
df['w']=df['w']*2
df

          w         x         y         z       new
a -3.499531  0.342680  1.153036 -0.252436  0.900600
b  1.962642  0.514219  0.221180 -1.070043 -0.848864
c -0.378992  0.255001 -0.458027  0.435163 -0.022863
d -1.167190  0.816847  0.672721 -0.104411  0.568310
e -1.062561  1.029733 -0.438136 -1.118318 -1.556454

#### based on numpy universal functions

In [51]:
df['w']=np.mean(df['w'])

In [54]:
df['x']=np.ones(5)

In [55]:
df

          w    x         y         z       new
a -0.829126  1.0  1.153036 -0.252436  0.900600
b -0.829126  1.0  0.221180 -1.070043 -0.848864
c -0.829126  1.0 -0.458027  0.435163 -0.022863
d -0.829126  1.0  0.672721 -0.104411  0.568310
e -0.829126  1.0 -0.438136 -1.118318 -1.556454

### 6. Drop the records

- simple df.drop() does <b>NOT</b> change original df
only df=df.drop() changes!!!

In [65]:
df = df.drop('sum', axis=1)

- <b>axis=0</b> is default!
shape (row, col) -- row has axis=0, col has axis=1

In [67]:
df.drop('e')

          w    x         y         z
a -0.829126  1.0  1.153036 -0.252436
b -0.829126  1.0  0.221180 -1.070043
c -0.829126  1.0 -0.458027  0.435163
d -0.829126  1.0  0.672721 -0.104411

In [66]:
df

          w    x         y         z
a -0.829126  1.0  1.153036 -0.252436
b -0.829126  1.0  0.221180 -1.070043
c -0.829126  1.0 -0.458027  0.435163
d -0.829126  1.0  0.672721 -0.104411
e -0.829126  1.0 -0.438136 -1.118318

### 7. dataFrame.shape

In [69]:
df.shape

(5, 4)

### 8. Get rows from dataFrame: loc(), iloc()

#### loc()

In [75]:
df.loc['a']

w   -0.829126
x    1.000000
y    1.153036
z   -0.252436
Name: a, dtype: float64

- The rows are <b>series</b> as well (through df.loc() method)

#### iloc()

In [76]:
df.iloc[0]

w   -0.829126
x    1.000000
y    1.153036
z   -0.252436
Name: a, dtype: float64

df.iloc[5] -- doesn't work, indexes <b>[a; row_size)</b>

### 9. Get an element from DataFrame: loc()

In [78]:
df

          w    x         y         z
a -0.829126  1.0  1.153036 -0.252436
b -0.829126  1.0  0.221180 -1.070043
c -0.829126  1.0 -0.458027  0.435163
d -0.829126  1.0  0.672721 -0.104411
e -0.829126  1.0 -0.438136 -1.118318

In [79]:
df.loc['a','w']

-0.8291263776404862

### 10. Get a subset of DataFrame: loc()

#### df.loc[row_list, col_list]

- You can use list, <b>np.array</b> for multiple records!!!!!

In [4]:
df.loc[['a','b'],['x','y']]

NameError: name 'df' is not defined

In [89]:
rows = np.array(df.index)
rows

array(['a', 'b', 'c', 'd', 'e'], dtype=object)

In [90]:
cols = np.array(df.columns)
cols

array(['w', 'x', 'y', 'z'], dtype=object)

In [93]:
df.loc[rows[:2], cols[:2]]

          w    x
a -0.829126  1.0
b -0.829126  1.0

In [95]:
lst = ['a','b','c','d','e','f','g']

In [97]:
df2=pd.DataFrame(data=randn(100,7),columns=lst)

In [103]:
rows=list(range(0,100))
df2.loc[rows[5:10]]

          a         b         c         d         e         f         g
5  0.507810 -0.862227  1.249470 -0.079611 -0.889731 -0.881798  0.018639
6  0.237845  0.013549 -1.635529 -1.044210  0.613039  0.736205  1.026921
7 -1.432191 -1.841188  0.366093 -0.331777 -0.689218  2.034608 -0.550714
8  0.750453 -1.306992  0.580573 -1.104523  0.690121  0.686890 -1.566688
9  0.904974  0.778822  0.428233  0.108872  0.028284 -0.578826 -1.199451

In [111]:
df

          a         b         c         d         e         f         g
0  1.618982  1.541605 -0.251879 -0.842436  0.184519  0.937082  0.731000
1  1.361556 -0.326238  0.055676  0.222400 -1.443217 -0.756352  0.816454
2  0.750445 -0.455947  1.189622 -1.690617 -1.356399 -1.232435 -0.544439
3 -0.668172  0.007315 -0.612939  1.299748 -1.733096 -0.983310  0.357508
4 -1.613579  1.470714 -1.188018 -0.549746 -0.940046 -0.827932  0.108863
5  0.507810 -0.862227  1.249470 -0.079611 -0.889731 -0.881798  0.018639
6  0.237845  0.013549 -1.635529 -1.044210  0.613039  0.736205  1.026921
7 -1.432191 -1.841188  0.366093 -0.331777 -0.689218  2.034608 -0.550714
8  0.750453 -1.306992  0.580573 -1.104523  0.690121  0.686890 -1.566688
9  0.904974  0.778822  0.428233  0.108872  0.028284 -0.578826 -1.199451

In [113]:
booldf = df >0

### 11. Conditions (broadcasted)

In [114]:
booldf

       a      b      c      d      e      f      g
0   True   True  False  False   True   True   True
1   True  False   True   True  False  False   True
2   True  False   True  False  False  False  False
3  False   True  False   True  False  False   True
4  False   True  False  False  False  False   True
5   True  False   True  False  False  False   True
6   True   True  False  False   True   True   True
7  False  False   True  False  False   True  False
8   True  False   True  False   True   True  False
9   True   True   True   True   True  False  False

In [115]:
df[booldf]

          a         b         c         d         e         f         g
0  1.618982  1.541605       NaN       NaN  0.184519  0.937082  0.731000
1  1.361556       NaN  0.055676  0.222400       NaN       NaN  0.816454
2  0.750445       NaN  1.189622       NaN       NaN       NaN       NaN
3       NaN  0.007315       NaN  1.299748       NaN       NaN  0.357508
4       NaN  1.470714       NaN       NaN       NaN       NaN  0.108863
5  0.507810       NaN  1.249470       NaN       NaN       NaN  0.018639
6  0.237845  0.013549       NaN       NaN  0.613039  0.736205  1.026921
7       NaN       NaN  0.366093       NaN       NaN  2.034608       NaN
8  0.750453       NaN  0.580573       NaN  0.690121  0.686890       NaN
9  0.904974  0.778822  0.428233  0.108872  0.028284       NaN       NaN

### 12. Filtering by row condition (avoid NaN)

In [117]:
df[df['c']>0]

          a         b         c         d         e         f         g
1  1.361556 -0.326238  0.055676  0.222400 -1.443217 -0.756352  0.816454
2  0.750445 -0.455947  1.189622 -1.690617 -1.356399 -1.232435 -0.544439
5  0.507810 -0.862227  1.249470 -0.079611 -0.889731 -0.881798  0.018639
7 -1.432191 -1.841188  0.366093 -0.331777 -0.689218  2.034608 -0.550714
8  0.750453 -1.306992  0.580573 -1.104523  0.690121  0.686890 -1.566688
9  0.904974  0.778822  0.428233  0.108872  0.028284 -0.578826 -1.199451

In [118]:
df[df['c']>0][['a','b']]

          a         b
1  1.361556 -0.326238
2  0.750445 -0.455947
5  0.507810 -0.862227
7 -1.432191 -1.841188
8  0.750453 -1.306992
9  0.904974  0.778822

In [119]:
df

          a         b         c         d         e         f         g
0  1.618982  1.541605 -0.251879 -0.842436  0.184519  0.937082  0.731000
1  1.361556 -0.326238  0.055676  0.222400 -1.443217 -0.756352  0.816454
2  0.750445 -0.455947  1.189622 -1.690617 -1.356399 -1.232435 -0.544439
3 -0.668172  0.007315 -0.612939  1.299748 -1.733096 -0.983310  0.357508
4 -1.613579  1.470714 -1.188018 -0.549746 -0.940046 -0.827932  0.108863
5  0.507810 -0.862227  1.249470 -0.079611 -0.889731 -0.881798  0.018639
6  0.237845  0.013549 -1.635529 -1.044210  0.613039  0.736205  1.026921
7 -1.432191 -1.841188  0.366093 -0.331777 -0.689218  2.034608 -0.550714
8  0.750453 -1.306992  0.580573 -1.104523  0.690121  0.686890 -1.566688
9  0.904974  0.778822  0.428233  0.108872  0.028284 -0.578826 -1.199451

### 13. Multiple conditions

In [121]:
df[(df['c']>0) & (df['a']>0)]

          a         b         c         d         e         f         g
1  1.361556 -0.326238  0.055676  0.222400 -1.443217 -0.756352  0.816454
2  0.750445 -0.455947  1.189622 -1.690617 -1.356399 -1.232435 -0.544439
5  0.507810 -0.862227  1.249470 -0.079611 -0.889731 -0.881798  0.018639
8  0.750453 -1.306992  0.580573 -1.104523  0.690121  0.686890 -1.566688
9  0.904974  0.778822  0.428233  0.108872  0.028284 -0.578826 -1.199451

- You can NOT use <b>and, or</b>, ---- 
use <b>& ,  |</b>  as <b>and, or</b> uses single conditions

### 14. df.reset_index()

In [124]:
#lst = ['a','b','c','d','e','f','g']
df1=pd.DataFrame(data=randn(5,3), index=['c','d','e','f','g'],columns=['a','b','c'])
df1

          a         b         c
c  0.321444  0.233519  1.014952
d -1.365343  0.276531 -0.955216
e -0.260513 -1.327491  0.037308
f -1.452641 -0.827602  2.292194
g  0.627888  0.952705 -0.829628

In [125]:
df1.reset_index()

  index         a         b         c
0     c  0.321444  0.233519  1.014952
1     d -1.365343  0.276531 -0.955216
2     e -0.260513 -1.327491  0.037308
3     f -1.452641 -0.827602  2.292194
4     g  0.627888  0.952705 -0.829628

- Please note: <b>index</b>  is added as a row, if you need in place, set param inplace=true

### 15. df.set_index()

In [126]:
df1['States']='CT NY WI MJ CA'.split()

In [127]:
df1.set_index('States')

               a         b         c
States
CT      0.321444  0.233519  1.014952
NY     -1.365343  0.276531 -0.955216
WI     -0.260513 -1.327491  0.037308
MJ     -1.452641 -0.827602  2.292194
CA      0.627888  0.952705 -0.829628

### 16. zip()

- <b>zip(a,b)</b> -- creates tuple (a,b)

### 17. Multiindex

In [7]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex(levels=[[u'G1', u'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [8]:
df=pd.DataFrame(randn(6,2), hier_index,['A','B'])

In [9]:
df

             A         B
G1 1 -0.596218 -1.995947
   2  0.434987 -0.047451
   3 -0.009742  0.885006
G2 1  1.260181  1.034857
   2  1.248955  0.031841
   3  1.643784  0.004384

In [10]:
df.loc['G1']

          A         B
1 -0.596218 -1.995947
2  0.434987 -0.047451
3 -0.009742  0.885006

In [11]:
df.loc['G1'].loc[1]

A   -0.596218
B   -1.995947
Name: 1, dtype: float64

### 18. Assigning index names

In [12]:
df.index.names

FrozenList([None, None])

In [13]:
df.index.names=['G-count','Number']

In [14]:
df

                       A         B
G-count Number
G1      1      -0.596218 -1.995947
        2       0.434987 -0.047451
        3      -0.009742  0.885006
G2      1       1.260181  1.034857
        2       1.248955  0.031841
        3       1.643784  0.004384

In [15]:
df1=pd.DataFrame(randn(7,5),columns=['G1','G1','G1','G2','G2'])
df1

         G1        G1        G1        G2        G2
0 -0.600260  0.890177  0.277503  0.522771 -0.105805
1  0.328428  1.114494 -0.148571 -0.904499  1.174924
2 -0.571141 -0.702361  1.784277  0.206392 -1.312950
3 -1.661933 -0.722016 -0.045794  0.830061  1.579146
4  0.713241  0.124573 -0.156495  0.099962 -1.327258
5  1.381344  0.746118  0.122409 -0.092317 -0.388535
6  1.175394 -0.504424  1.078481  0.012482 -1.809576

In [20]:
df1.index.name='num'

In [21]:
df1

           G1        G1        G1        G2        G2
num
0   -0.600260  0.890177  0.277503  0.522771 -0.105805
1    0.328428  1.114494 -0.148571 -0.904499  1.174924
2   -0.571141 -0.702361  1.784277  0.206392 -1.312950
3   -1.661933 -0.722016 -0.045794  0.830061  1.579146
4    0.713241  0.124573 -0.156495  0.099962 -1.327258
5    1.381344  0.746118  0.122409 -0.092317 -0.388535
6    1.175394 -0.504424  1.078481  0.012482 -1.809576

### 19. xs()

- Use xs() instead of several loc()

In [22]:
df

                       A         B
G-count Number
G1      1      -0.596218 -1.995947
        2       0.434987 -0.047451
        3      -0.009742  0.885006
G2      1       1.260181  1.034857
        2       1.248955  0.031841
        3       1.643784  0.004384

In [23]:
df.xs(2,level="Number")

                A         B
G-count
G1       0.434987 -0.047451
G2       1.248955  0.031841

### 20. Missing data

In [41]:
dict={'A':[1,2,np.nan,3,4,5],'B':[5,np.nan,np.nan,3,np.nan, 9],'C':[1,2,3, np.nan, 8,9]}

In [42]:
df=pd.DataFrame(dict)
df.index.name="num"

In [43]:
df

       A    B    C
num
0    1.0  5.0  1.0
1    2.0  NaN  2.0
2    NaN  NaN  3.0
3    3.0  3.0  NaN
4    4.0  NaN  8.0
5    5.0  9.0  9.0

### 21.  dtopna()

- removes any rows  with nan (default -- axis=0) or columns with <b>axis=1</b> param

In [44]:
df.dropna()

       A    B    C
num
0    1.0  5.0  1.0
5    5.0  9.0  9.0

In [45]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

- <b>thresh=2</b> -- removes all records where counts of NaN =2

In [46]:
df.dropna(thresh=2)

       A    B    C
num
0    1.0  5.0  1.0
1    2.0  NaN  2.0
3    3.0  3.0  NaN
4    4.0  NaN  8.0
5    5.0  9.0  9.0

In [50]:
df

       A    B    C
num
0    1.0  5.0  1.0
1    2.0  NaN  2.0
2    NaN  NaN  3.0
3    3.0  3.0  NaN
4    4.0  NaN  8.0
5    5.0  9.0  9.0

### 22. fillna()

- fill the values instead of NaNs

In [49]:
df.fillna(value=np.mean(df))

       A         B    C
num
0    1.0  5.000000  1.0
1    2.0  5.666667  2.0
2    3.0  5.666667  3.0
3    3.0  3.000000  4.6
4    4.0  5.666667  8.0
5    5.0  9.000000  9.0

In [56]:
df['A'].fillna(value=df['A'].mean())

num
0    1.0
1    2.0
2    3.0
3    3.0
4    4.0
5    5.0
Name: A, dtype: float64

### 23. Groupby

- allow to group rows together and perform aggregate functions based on columns

In [57]:
dict = {'Company':['GOOD','GOOD','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]}

In [58]:
df=pd.DataFrame(dict)
df

  Company   Person  Sales
0    GOOD      Sam    200
1    GOOD  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [61]:
by_comp = df.groupby('Company')
by_comp.mean()

         Sales
Company
FB       296.5
GOOD     160.0
MSFT     232.0

In [66]:
by_comp.sum()

         Sales
Company
FB         593
GOOD       320
MSFT       464

- as the result of function is dataFrame, you can use df methods (loc[], etc)

### 24. groupby().describe() and groupby().describe()

In [67]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOD      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

!!!!!!!!!!!!!!!!!!!!!!!!!!

In [68]:
df.groupby('Company').describe().transpose()

Company              FB        GOOD        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

### 25. Concat()

In [38]:
index1=[0,1,2,3]
col1=['a','b','c','d']
rand_data=np.random.randn(4,4)
rand_data
df=pd.DataFrame(rand_data, index1, col1)
df

          a         b         c         d
0  0.941113 -0.662013 -0.723571 -0.357273
1  1.187082  2.512364  0.355142  0.778746
2  0.405890  0.310215  0.653639 -0.609937
3 -0.228040 -0.038446  1.032800  0.454741

In [39]:
index2=[4,5,6]
df2=pd.DataFrame(np.random.randn(3,4),index2, col1)
df2

          a         b         c         d
4 -1.318470  0.938952  0.726610  2.049655
5  1.082397  0.434457 -0.784714  0.751836
6 -0.663904 -0.212696 -0.173157  0.576566

In [40]:
pd.concat([df,df2])

          a         b         c         d
0  0.941113 -0.662013 -0.723571 -0.357273
1  1.187082  2.512364  0.355142  0.778746
2  0.405890  0.310215  0.653639 -0.609937
3 -0.228040 -0.038446  1.032800  0.454741
4 -1.318470  0.938952  0.726610  2.049655
5  1.082397  0.434457 -0.784714  0.751836
6 -0.663904 -0.212696 -0.173157  0.576566

### 26. Merge

In [41]:
df=df.rename(columns={'c':'key'})

In [42]:
df=df.drop(columns='d')

In [43]:
df

          a         b       key
0  0.941113 -0.662013 -0.723571
1  1.187082  2.512364  0.355142
2  0.405890  0.310215  0.653639
3 -0.228040 -0.038446  1.032800

In [44]:
df2=pd.DataFrame(np.random.randn(4,4),columns=['c','d','e','f'])

In [45]:
df2

          c         d         e         f
0  0.541997  1.257405 -0.239987  0.616478
1  0.752206  0.537546  0.990230  0.876460
2 -0.482707 -0.867151  0.248997 -1.309869
3 -1.216493  0.879283  0.046835 -0.417814

In [46]:
df2 = pd.concat([df2, df['key']],axis=1)

In [50]:
left=df2
left

          c         d         e         f       key
0  0.541997  1.257405 -0.239987  0.616478 -0.723571
1  0.752206  0.537546  0.990230  0.876460  0.355142
2 -0.482707 -0.867151  0.248997 -1.309869  0.653639
3 -1.216493  0.879283  0.046835 -0.417814  1.032800

In [51]:
df.loc[0,'key']=1
right=df
right

          a         b       key
0  0.941113 -0.662013  1.000000
1  1.187082  2.512364  0.355142
2  0.405890  0.310215  0.653639
3 -0.228040 -0.038446  1.032800

In [58]:
pd.merge(left[['c','key']], right[['a','key']],how='outer')

          c       key         a
0  0.541997 -0.723571       NaN
1  0.752206  0.355142  1.187082
2 -0.482707  0.653639  0.405890
3 -1.216493  1.032800 -0.228040
4       NaN  1.000000  0.941113

In [59]:
pd.merge(left[['c','key']], right[['a','key']],how='inner')

          c       key         a
0  0.752206  0.355142  1.187082
1 -0.482707  0.653639  0.405890
2 -1.216493  1.032800 -0.228040

#### on=['key1','key2'] -- merge based on several keys

### 27. Join

### 28. Operations

In [63]:
df=pd.DataFrame({'col1':[1,2,3,4],
                 'col2':[444,333,555,444],
                 'col3':['aab','bbc','ffg','jjy']
    
})

In [4]:
df

   col1  col2 col3
0     1   444  aab
1     2   333  bbc
2     3   555  ffg
3     4   444  jjy

#### unique()

In [8]:
df['col2'].unique()

array([444, 333, 555], dtype=int64)

#### ninuque()

In [9]:
df['col2'].nunique()

3

#### value_counts()

In [10]:
df['col2'].value_counts()

444    2
555    1
333    1
Name: col2, dtype: int64

#### apply(function_name)

In [11]:
def times2(x):
    return x*2

df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

- You can apply different functions, ie. len() for the string!

#### lambda for apply()

In [12]:
df['col1'].apply(lambda x: x*3)

0     3
1     6
2     9
3    12
Name: col1, dtype: int64

#### columns, index

In [14]:
df.columns

Index([u'col1', u'col2', u'col3'], dtype='object')

In [15]:
df.index

RangeIndex(start=0, stop=4, step=1)

### 29. Sort()

In [5]:
df.sort_values('col2')

   col1  col2 col3
1     2   333  bbc
0     1   444  aab
3     4   444  jjy
2     3   555  ffg

### 30. isnull()

In [6]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

### 31. pivot_table()

In [13]:
df=pd.DataFrame({'A':['foo','foo','foo','boo','boo','boo'],
   'B':['one','one','two','two','one','one'],
   'C':['x','y','x','y','x','y'],
   'D':[1,2,3,5,4,1]})

In [14]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  2
2  foo  two  x  3
3  boo  two  y  5
4  boo  one  x  4
5  boo  one  y  1

In [15]:
df.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
boo one  4.0  1.0
    two  NaN  5.0
foo one  1.0  2.0
    two  3.0  NaN

### 32. pwd()

In [19]:
pwd

u'C:\\Users\\novikovay\\Desktop\\DS\\Udemy\\Python fo Data Science and Machine Learning Bootcamp\\03-Python-for-Data-Analysis-Pandas'

### 33. Data input/output

#### CSV, HTML, SQL, Excel

- sqlalchemy

- lxml

- html5lib

- BeautifulSoap4

In [17]:
pwd

u'C:\\Users\\novikovay\\Desktop\\DS\\Udemy\\Python fo Data Science and Machine Learning Bootcamp\\03-Python-for-Data-Analysis-Pandas'

### 33.1 -- csv!

In [27]:
df = pd.read_csv('train.csv')

In [28]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [33]:
df.to_csv('Test.csv')

In [36]:
pd.read_csv('Test.csv').head(2)

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

#### Wrong indices! How to correct!

In [39]:
df.to_csv('Test.csv',index=False)
pd.read_csv('Test.csv').head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [42]:
pwd

u'C:\\Users\\novikovay\\Desktop\\DS\\Udemy\\Python fo Data Science and Machine Learning Bootcamp\\03-Python-for-Data-Analysis-Pandas'

### 33.2 excel!

In [44]:
df = pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

In [45]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [48]:
df.to_excel('Excel_Sample2.xlsx', sheet_name='Sheet1')

In [49]:
pd.read_excel('Excel_Sample2.xlsx', sheet_name='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### 33.3 HTML

In [50]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [55]:
type(data[0])

pandas.core.frame.DataFrame

In [56]:
df=data[0]

In [57]:
df.head(5)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 21, 2018"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","December 5, 2017"

WOW!

### 33.4 SQL!

In [58]:
from sqlalchemy import create_engine

In [59]:
engine = create_engine('sqlite:///:memory:')

In [64]:
df.head(3)

   col1  col2 col3
0     1   444  aab
1     2   333  bbc
2     3   555  ffg

In [66]:
df.to_sql('my_table2',engine)

In [68]:
pd.read_sql('my_table2', con=engine)

   index  col1  col2 col3
0      0     1   444  aab
1      1     2   333  bbc
2      2     3   555  ffg
3      3     4   444  jjy